package com.edu.less05.homework;

/*
 * Составить программу сравнения двух чисел 1 и 2. 
 * Если 1 меньше 2 – вывести на экран слово «yes»,
 * в противном случае – слово «no»
 */
public class TaskBranches02 {

	public static void main(String[] args) {
		int num1 = 1;
		int num2 = 2;

		if (num1 < num2) {
			System.out.println("yes");
		} else {
			System.out.println("no");
		}

	}

}
